MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMD10D13AM/mcu.h
#define HMCRAMC0_SIZE                  _UINT32_(0x00001000)    /*    4kB Memory segment type: ram */
#define HPB0_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB1_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define PERIPHERALS_SIZE               _UINT32_(0x20000000)    /* 524288kB Memory segment type: io */

#define FLASH_ADDR                     _UINT32_(0x00000000)    /* FLASH base address (type: flash)*/
#define CAL_ADDR                       _UINT32_(0x00800000)    /* CAL base address (type: fuses)*/
#define LOCKBIT_ADDR                   _UINT32_(0x00802000)    /* LOCKBIT base address (type: fuses)*/
#define OTP1_ADDR                      _UINT32_(0x00806000)    /* OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UINT32_(0x00806008)    /* OTP2 base address (type: fuses)*/
#define OTP4_ADDR                      _UINT32_(0x00806020)    /* OTP4 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UINT32_(0x00806030)    /* TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UINT32_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define HMCRAMC0_ADDR                  _UINT32_(0x20000000)    /* HMCRAMC0 base address (type: ram)*/
#define HPB0_ADDR                      _UINT32_(0x40000000)    /* HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UINT32_(0x41000000)    /* HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UINT32_(0x42000000)    /* HPB2 base address (type: io)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/
#define SCS_ADDR                       _UINT32_(0xe000e000)    /* SCS base address (type: io)*/
#define PERIPHERALS_ADDR               _UINT32_(0x40000000)    /* PERIPHERALS base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR SAMD10D13AM                                        */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X10020101)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR SAMD10D13AM                                   */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for SAMD10D13AM */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_CMP_0                            1 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            2 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              3 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            4 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        12 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        13 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        14 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        15 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        16 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        17 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        18 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        19 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_DMAC_CH_0                           20 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           21 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           22 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           23 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_TCC0_OVF                            24 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            25 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            26 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           27 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           28 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           29 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           30 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TC1_OVF                             31 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            32 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            33 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             34 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            35 /* ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            36 /* ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_ADC_RESRDY                          37 /* ID for ADC event generator RESRDY */
#define EVENT_ID_GEN_ADC_WINMON                          38 /* ID for ADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           39 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           40 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            41 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_DAC_EMPTY                           42 /* ID for DAC event generator EMPTY */

/* ************************************************************************** */
/*  Event User IDs for SAMD10D13AM */
/* ************************************************************************** */
#define EVENT_ID_USER_DMAC_CH_0                           0 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           1 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           2 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           3 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_TCC0_EV_0                           4 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                           5 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                           6 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                           7 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                           8 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                           9 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TC1_EVU                            10 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            11 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_ADC_START                          12 /* ID for ADC event user START */
#define EVENT_ID_USER_ADC_SYNC                           13 /* ID for ADC event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           14 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           15 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_DAC_START                          16 /* ID for DAC event user START */

#ifdef __cplusplus
}
#endif

#endif /* _SAMD10D13AM_H_ */

